In [1]:
!pip3 -q install numpy pandas matplotlib seaborn geopy folium datetime scipy sklearn tensorflow

In [2]:
import pandas as pd
df = pd.read_csv('uber-raw-data-aug14.csv')

In [3]:
display(df)

                 Date/Time      Lat      Lon    Base
0         8/1/2014 0:03:00  40.7366 -73.9906  B02512
1         8/1/2014 0:09:00  40.7260 -73.9918  B02512
2         8/1/2014 0:12:00  40.7209 -74.0507  B02512
3         8/1/2014 0:12:00  40.7387 -73.9856  B02512
4         8/1/2014 0:12:00  40.7323 -74.0077  B02512
...                    ...      ...      ...     ...
829270  8/31/2014 23:55:00  40.7552 -73.9753  B02764
829271  8/31/2014 23:55:00  40.7552 -73.9753  B02764
829272  8/31/2014 23:55:00  40.7617 -73.9788  B02764
829273  8/31/2014 23:59:00  40.7395 -73.9889  B02764
829274  8/31/2014 23:59:00  40.7270 -73.9802  B02764

[829275 rows x 4 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 829275 entries, 0 to 829274
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  829275 non-null  object
 1   Lat        829275 non-null  float64
 2   Lon        829275 non-null  float64
 3   Base       829275 non-null  object
dtypes: float64(2), object(2)
memory usage: 25.3+ MB

In [5]:
df.head()
df.describe()

                 Lat            Lon
count  829275.000000  829275.000000
mean       40.737781     -73.970160
std         0.043628       0.061483
min        39.656900     -74.773700
25%        40.719000     -73.995800
50%        40.740700     -73.982600
75%        40.760500     -73.961200
max        41.318200     -72.335900

In [6]:
print(type(df.loc[0, 'Date/Time']))

<class 'str'>

In [7]:
df['Date/Time'] = pd.to_datetime(df['Date/Time'])

Q1. On what date did we see the most number of Uber pickups?



**Skill Test:** Grouping & Counting

In [10]:
# Convert the 'Date/Time' column to datetime format

df['Date/Time'] = pd.to_datetime(df['Date/Time'])

# Group by date and count the number of pickups

pickup_counts = df.groupby(df['Date/Time'].dt.date).size()
print(pickup_counts)

# Find the date with the highest number of pickups

result = pickup_counts.max()
print("Date with most number of Uber pickups:",result)
date_with_higest_pickups = pickup_counts.max()
print("Value:",date_with_higest_pickups)

Date/Time
2014-08-01    32353
2014-08-02    28678
2014-08-03    23146
2014-08-04    24952
2014-08-05    28094
2014-08-06    30495
2014-08-07    32759
2014-08-08    30411
2014-08-09    26286
2014-08-10    20584
2014-08-11    22632
2014-08-12    29646
2014-08-13    29788
2014-08-14    30457
2014-08-15    28974
2014-08-16    26234
2014-08-17    21209
2014-08-18    21956
2014-08-19    24834
2014-08-20    27955
2014-08-21    32304
2014-08-22    29512
2014-08-23    27097
2014-08-24    22036
2014-08-25    22093
2014-08-26    24550
2014-08-27    27018
2014-08-28    28597
2014-08-29    27424
2014-08-30    23930
2014-08-31    23271
dtype: int64
Date with most number of Uber pickups: 32759
Value: 32759

Q.2 How many Uber pickups were made on the date with the highest number of pickups?

**Skill Test:** Indexing and filtering

In [12]:
# Filter the DataFrame to include only the rows for the date with the highest number of pickups

result = pickup_counts.idxmax()
print("Date with most number of Uber pickups:",result)

# Get the count of pickups on the highest date

date_with_higest_pickups = pickup_counts.max()
print("Number of Uber pickups on the date with the higestnumber of pickups:",date_with_higest_pickups)

Date with most number of Uber pickups: 2014-08-07
Number of Uber pickups on the date with the higestnumber of pickups: 32759

Q.3 How many unique TLC base companies are affiliated with the Uber pickups in the dataset?

**Skill Test:** Counting unique values

In [ ]:
# Count the number of unique TLC base companies
unique_companies = df[]